Repository: hongdnn/Passenger-App
Catalog: lib/l10n/app_*.arb
Languages: th

source: Favorites
th: รายการโปรด

source: Activity
th: กิจกรรม

source: Message
th: ข้อความ

source: Current location
th: ใช้ตำแหน่งปัจจุบัน

source: Save place
th: สถานที่ที่บันทึกไว้

source: Today
th: วันนี้

# promotion_page_title
source: My promo code
th: รหัสโปรโมชันของคุณ

# search_empty_title
source: We are sorry
th: พวกเราขอโทษ

# search_empty_subtitle
source: We cannot find what you are looking for :(
th: แต่ไม่พบสิ่งที่คุณกำลังค้นหา :(

# apply_promotion_dialog_title
source: Cannot continue
th: ไม่สามารถดำเนินการต่อได้

# apply_promotion_dialog_msg
source: Cannot continue An error occurred, please try again
th: ไม่สามารถดำเนินการต่อได้ เกิดข้อผิดพลาด บางอย่าง กรุณาลองอีกครั้ง

source: Agree
th: ตกลง

# promotion_apply_now
source: Apply
th: ใช้เลย

source: minute
th: นาที

source: km
th: กม.

# hint_text_search
source: Where are you going?
th: จะไปไหนกันดี?

# book_now
source: Instant
th: เรียกตอนนี้

# landing_page_title
source: Choose destination
th: เลือกปลายทาง

source: Last place
th: สถานที่ล่าสุด

source: Book again
th: เรียกอีกครั้ง

source: Book in advance
th: จองล่วงหน้า

source: Add a place
th: เพิ่มจุดหมาย

source: search
th: ค้นหา

source: Recently used
th: สถานที่ที่ใช้บ่อย

# ready_to_book
source: Ready to book this ride?
th: เรียกอีกครั้ง

source: Add Address
th: เพิ่มจุดหมาย

source: Suggested Rides
th: เลือกประเภทรถ

source: Next
th: ถัดไป

source: call now
th: เรียกตอนนี้

source: Save address
th: บันทึกที่อยู่

source: min
th: นาที

source: Choose time
th: เลือกเวลาจองล่วงหน้า

# rating_page_title
source: Please rate my service
th: ให้คะแนนการบริการ

# rating_section_title_reason
source: How's the service? Let us know
th: บริการเป็นยังไง บอกเราได้นะ

# rating_section_title_tip
source: Consider giving a tip
th: โปรดพิจารณาให้ทิป

# rating_section_title_comment
source: Additional Comments
th: ความคิดเห็นเพิ่มเติม

# rating_comment_hint
source: Tell us more (Optinal)
th: ความคิดเห็นเพิ่มเติม (ไม่จำเป็นต้องระบุ)

# error_common_msg
source: Something went wrong
th: บางอย่างผิดพลาด

# checkout_confirmation_title
source: Confirm driver and pay
th: ยืนยันการจอง

# checkout_confirmation_button
source: Confirm
th: ยืนยันการจอง

source: Travel
th: การเดินทาง

source: Add note to driver
th: เพิ่มรายละเอียดถึงคนขับ

source: Distance
th: ระยะทาง

source: Travel time
th: เวลาเดินทาง

source: Confirm
th: ยืนยัน

# looking_for_driver
source: Looking for a driver.
th: กำลังค้นหาคนขับ...

source: Cancel reservation
th: ยกเลิกการจอง

source: My card
th: บัตรของฉัน

# msg_delete_favorite
source: This location will be removed from your favorite permanently
th: สถานที่นี้จะถูกลบออกจากสถานที่ ที่บันทึกไว้ของคุณอย่างถาวร

source: Delete
th: ลบ

source: Cancel
th: ยกเลิก

source: Message to driver
th: รายละเอียดถึงคนขับ

# hint_text_message_to_driver
source: Such as a spotting place
th: เช่น จุดสังเกดสถานที่

source: Edit
th: แก้ไข

# cannot_find_driver
source: we couldn't find any drivers at this time.
th: ไม่พบคนขับในขณะนี้

source: search again
th: ค้นหาอีกครั้ง

source: Choose from map
th: เลือกจากแผนที่

# save_address_favourite
source: Save your favourite places
th: บันทึกสถานที่ของคุณ

source: No data for
th: ไม่มีข้อมูลสำหรับ

source: Order summary
th: สรุปรายการ

source: Payment methods
th: ชำระเงิน

source: Select payment method
th: เลือกวิธีการชำระเงินอื่น

# confirm_cancel
source: Confirm cancellation
th: ยืนยันยกเลิกการจอง

# message_confirm_cancel
source: If you cancel this booking You will be suspended from the service for a period of 3 hours.
th: หากยกเลิกการจองครั้งนี้ คุณจะถูกระงับการให้บริการ เป็นระยะเวลา 3 ชั่วโมง

# message_cancel_booking
source: Cancel the reservation Press the OK button.
th: หากต้องการยกเลิกการจอง ให้กดปุ่ม “ยืนยัน”

# go_back
source: Back
th: กลับ

# cancel_booking_title
source: Cancel my reservation
th: ยกเลิกการจอง

# reason_cancel_booking
source: Reason for cancellation
th: เหตุผลที่ยกเลิกการจอง

source: Payment
th: ชำระเงิน

source: Expressway
th: ทางด่วน

source: All items
th: รายการทั้งหมด

# choose_payment_method
source: Choose another payment method
th: เลือกวิธีการชำระเงินอื่น

# payment_message
source: Payment verification in progress.
th: กำลังอยู่ในระหว่าง การตรวจสอบการชำระเงิน

# cannot_reserved
source: This time cannot be reserved.
th: ไม่สามารถจองเวลาดังกล่าวได้.

# booking_time_err_msg
source: Please book at least 1 hour in advance.
th: กรุณาจองล่วงหน้าอย่างน้อย 1 ชั่วโมง

source: Unable to continue
th: ไม่สามารถดำเนินการต่อได้

source: Because you already have a reservation.
th: เนื่องจากคุณมีรายการจองแล้ว.

source: Ongoing
th: กำลังดำเนินการ

source: Completed
th: รายการที่สำเร็จ

source: Canceled
th: รายการที่ยกเลิก

source: Activities
th: กิจกรรม

source: Get a car
th: เรียกรถกัน

source: Total
th: รายการทั้งหมด

source: Emergency Call
th: โทรฉุกเฉิน

source: Silent ride
th: ห้ามรบกวนขณะโดยสาร

source: Do not disturb
th: ห้ามรบกวนขณะโดยสาร

source: Driver
th: คนขับ

source: Rate service
th: ให้คะแนนการบริการ

source: Summary
th: สรุปรายการ

source: Ride again
th: เรียกอีกครั้ง

# report_issue
source: Report an issue
th: รายงานปัญหา

source: Subtotal
th: ราคาสุทธิ

# favorite_title_hint
source: Address name
th: ชื่อเรียกที่อยู่

# favorite_desc_hint
source: Address details to rider
th: เพิ่มรายละเอียดถึงคนขับ

# error_msg_payment
source: Payment unsuccessful, Please try again.
th: การชำระเงินไม่สำเร็จ กรุณาทำรายการใหม่อีกครั้ง

source: Pay
th: ชำระเงิน

# payment_methods_trip_detail
source: Payment methods
th: วิธีการชำระเงิน

# select_payment_method_trip_detail
source: Select payment method
th: เลือกวิธีการชำระเงินอื่น

# schedule_a_ride_for_header
source: Schedule a ride for
th: เวลาจอง

# schedule_a_ride_for_title
source: Schedule a ride for
th: จองล่วงหน้า

# primary_card
source: Primary
th: บัตรหลัก

source: Waiting for payment
th: รอชำระเงิน

source: Unsuccessful payment
th: ชำระเงินไม่สำเร็จ

source: Successful
th: สำเร็จแล้ว

# canceled_drive
source: Canceled
th: ยกเลิกแล้ว

# scb_payment
source: SCB easy
th: แอป SCB easy

# qrcode_payment
source: QR Code
th: ชำระเงินผ่าน QR Code

source: Add payment method
th: เพิ่มช่องทางการชำระเงิน

source: Help
th: ช่วยเหลือ

# confirm_to_change_payment_method_title
source: Confirm to change primary payment method
th: เปลี่ยนช่องทางการชำระเงินหลัก

# confirm_to_change_payment_method_msg
source: Do you confirm to change your primary payment method?
th: คุณต้องการเปลี่ยนช่องทาง การชำระเงินหลักเป็น บัตรของฉัน

source: Rider found
th: พบคนขับแล้ว

source: The driver is here
th: คนขับมาถึงแล้ว

source: I'm arrived
th: ถึงจุดหมายแล้ว

# bookmark_add_new_title
source: Add location (Save your favourite places)
th: เพิ่มสถานที่เพื่อบันทึก

# book_trip_now
source: Book now
th: จองทันที

source: Add card
th: เพิ่มบัตร

source: Card information
th: ข้อมูลบัตร

source: Card name
th: ชื่อบนบัตร

source: Card number
th: หมายเลขบัตร

source: Card expired
th: บัตรหมดอายุ

# code_on_the_back_card
source: CVV
th: รหัสหลังบัตร

# name_of_card
source: Card nickname (optional)
th: ตั้งชื่อบัตร

# message_add_card
source: A minimum amount will be charged to your cardto prove its validity. The amount will be automatically refunded shortly after.
th: เราจะหักเงินเพื่อใช้ยืนยันบัตรของคุณก่อน เงินจะถูกโอนคืนให้โดยอัตโนมัติภายหลัง

# please_enter_card_name
source: Please enter a valid card name
th: กรุณาใส่ชื่อบัตรที่ถูกต้อง

# please_enter_card_number
source: Please enter a valid card number
th: กรุณากรอกหมายเลขบัตรที่ถูกต้อง

# please_enter_card_expired
source: Please enter a valid card expired date
th: กรุณากรอกวันที่บัตรหมดอายุ

# please_enter_cvv
source: Please enter a valid cvv number
th: โปรดป้อนหมายเลข cvv ที่ถูกต้อง

# card_number_invalid
source: Invalid card number
th: เลขบัตรไม่ถูกต้อง

# cvv_number_invalid
source: Invalid cvv number
th: หมายเลข cvv ไม่ถูกต้อง

# expired_date_invalid
source: Invalid card expiration date
th: วันหมดอายุบัตรไม่ถูกต้อง

# add_card_success
source: Add card successfully
th: เพิ่มบัตรสำเร็จ

# you_have_success
source: You have succeeded
th: คุณทำการสำเร็จแล้ว

source: Edit card
th: แก้ไขบัตร

source: Save
th: บันทึก

# success_payment
source: Successful payment
th: ชำระเงินสำเร็จ

# thanks_for_your_pay
source: Thank you for your payment
th: ขอบคุณที่เลือกใช้บริการโรบินฮู้ด

source: Driver to Pick-up Point
th: คนขับ ถึง จุดรับผู้โดยสาร

source: Pick-up Point to Destination
th: จุดรับผู้โดยสาร ถึง ปลายทาง

source: Delete card
th: ลบการ์ด

# message_delete_card
source: Confirm card deletion
th: เราจะทำการเปลี่ยนช่องทาง การชำระเงินหลักเป็น SCB easy

source: Delete primary card
th: ลบบัตรหลัก

# message_delete_primary_card
source: We will change the channel. The main payment is SCB easy.
th: เราจะทำการเปลี่ยนช่องทาง การชำระเงินหลักเป็น SCB easy

# delete_card_success_1
source: The card number
th: ลบบัตรหมายเลข

# delete_card_success_2
source: has been deleted.
th: เรียบร้อย

# update_card_success
source: Successful record.
th: บันทึกสำเร็จ

# error_message
source: An error occurred Please try again.
th: เกิดข้อผิดพลาด โปรดลองอีกครั้ง.

source: permission is required
th: ต้องขออนุญาติ

source: Required
th: การอนุญาต

source: Setting
th: การตั้งค่า

source: Location
th: ที่ตั้ง

# success_advance_booking
source: Successful, Advance Booking
th: ทำรายการจองล่วงหน้าสำเร็จ

source: The driver is almost there
th: คนขับใกล้ถึงแล้ว

source: I'm on my way
th: กำลังเดินทาง

source: Driver arrived destination
th: ถึงจุดหมายแล้ว

source: Driver found
th: พบคนขับแล้ว

source: Driver will arrived within 1 hours
th: คนขับจะถึงภายใน 1 ชั่วโมง

source: Driver Pick-up
th: กำลังเดินทาง

source: The driver is waiting
th: คนขับรออยู่

source: Drop off mid destination
th: ส่งปลายทางกลาง

# promo_expiration
source: expiration dates
th: ใช้งานได้ถึงวันที่

source: Use
th: ใช้

source: Balance
th: ยอดคงเหลือ

source: Resend
th: ส่งอีกครั้ง

# type_message
source: Type a message
th: พิมพ์ข้อความ

# tip_payment_title_header
source: Payment
th: ชำระเงิน

# tip_order_summary
source: Order summary
th: สรุปรายการ

# tip_value
source: Tip
th: ทิป

# tip_total
source: Total
th: รายการทั้งหมด

# tip_payment_methods
source: Payment methods
th: วิธีการชำระเงิน

# tip_select_payment_method
source: Select payment method
th: เลือกวิธีการชำระเงินอื่น

source: Incorrect information
th: ข้อมูลไม่ถูกต้อง

source: Fare
th: ค่าเดินทาง

source: Tip
th: ค่าทิป

source: Enter promo code here
th: รหัสโปรโมชันของคุณ

source: Successful payment
th: ชำระเงินสำเร็จ

source: Complete within 48 hours
th: โปรดทำรายการภายใน 1 ชั่วโมง

source: Losing Connect
th: การเชื่อมต่อล้มเหลว

source: Try again
th: ลองอีกครั้ง

source: Notification
th: การแจ้งเตือน

source: Per km
th: ระยะทาง

source: Minimum
th: ราคาขั้นต่ำ

source: Baht
th: บาท

source: You do not have any ongoing activities.
th: คุณไม่มีรายการที่กำลังดำเนินการอยู่

source: You do not have any completed activities.
th: คุณไม่มีรายการที่สำเร็จอยู่

source: You do not have any canceled activities.
th: คุณไม่มีรายการที่ยกเลิกอยู่

# upsert_error_title
source: All prices are subject to change
th: ราคามีการเปลี่ยนแปลง

# upsert_error_content
source: At this time, the fare has been changed. Please check the details again
th: ขณะนี้ราคาโดยสารมีการปรับ กรุณาตรวจสอบรายละเอียดอีกครั้ง
